<a href="https://colab.research.google.com/github/dan-candeira/Nuforc-Project/blob/master/5.8-Adicionando_variaveis/5.8-nuforc.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(
    'https://raw.githubusercontent.com/dan-candeira/Nuforc-Project/master/5.7-Preparacao/df_OVNI_limpo.csv', 
    index_col=0)

In [4]:
#https://www.geeksforgeeks.org/python-pandas-split-strings-into-two-list-columns-using-str-split/
datetime = df['Date / Time'].str.split(" ", n = 1, expand = True)

In [5]:
datetime.head()

         0      1
0  9/30/97  22:00
1  9/28/97  23:15
2  9/27/97  23:00
3  9/27/97  05:00
4  9/25/97  22:00

In [6]:
df['Sight_Date'] = datetime[0]
df['Sight_Time'] = datetime[1]

In [7]:
df.head()

     Date / Time           City State     Shape Sight_Date Sight_Time
0  9/30/97 22:00        Madison    WI     Light    9/30/97      22:00
1  9/28/97 23:15  San Francisco    CA  Triangle    9/28/97      23:15
2  9/27/97 23:00           Egan    SD     Other    9/27/97      23:00
3  9/27/97 05:00      Crestwood    KY      Disk    9/27/97      05:00
4  9/25/97 22:00     Clearfield    UT  Triangle    9/25/97      22:00

In [8]:
del df['Date / Time']

In [9]:
df.head()

            City State     Shape Sight_Date Sight_Time
0        Madison    WI     Light    9/30/97      22:00
1  San Francisco    CA  Triangle    9/28/97      23:15
2           Egan    SD     Other    9/27/97      23:00
3      Crestwood    KY      Disk    9/27/97      05:00
4     Clearfield    UT  Triangle    9/25/97      22:00

In [10]:
weekday={
    0: 'Segunda-feira',
    1: 'Terça-feira',
    2: 'Quarta-feira',
    3: 'Quinta-feira',
    4: 'Sexta-feira',
    5: 'Sábado',
    6: 'Domingo'}

In [11]:
#https://stackoverflow.com/questions/29096381/num-day-to-name-day-with-pandas
df['Sight_Weekday'] = pd.to_datetime(df['Sight_Date']).dt.dayofweek.map(weekday)

In [12]:
df.head()

            City State     Shape Sight_Date Sight_Time Sight_Weekday
0        Madison    WI     Light    9/30/97      22:00   Terça-feira
1  San Francisco    CA  Triangle    9/28/97      23:15       Domingo
2           Egan    SD     Other    9/27/97      23:00        Sábado
3      Crestwood    KY      Disk    9/27/97      05:00        Sábado
4     Clearfield    UT  Triangle    9/25/97      22:00  Quinta-feira

In [13]:
day_month = df['Sight_Date'].str.split("/", n = 2, expand = True)

In [14]:
day_month.head()

   0   1   2
0  9  30  97
1  9  28  97
2  9  27  97
3  9  27  97
4  9  25  97

In [15]:
df['Sight_Day'] = day_month[1]
df['Sight_Month'] = day_month[0]

In [16]:
df.head()

,City,State,Shape,Sight_Date,Sight_Time,Sight_Weekday,Sight_Day,Sight_Month
0,Madison,WI,Light,9/30/97,22:00,Terça-feira,30,9
1,San Francisco,CA,Triangle,9/28/97,23:15,Domingo,28,9
2,Egan,SD,Other,9/27/97,23:00,Sábado,27,9
3,Crestwood,KY,Disk,9/27/97,05:00,Sábado,27,9
4,Clearfield,UT,Triangle,9/25/97,22:00,Quinta-feira,25,9

In [17]:
df.to_csv('df_OVNI_preparado.csv')